In [25]:
import pandas as pd

In [32]:
data = "Resources/data_csv.csv"

In [33]:
data_df = pd.read_csv(data)

In [38]:
data_df.head()

             Name Code
0     Afghanistan   AF
1   Åland Islands   AX
2         Albania   AL
3         Algeria   DZ
4  American Samoa   AS

In [41]:
code_table = data_df.rename(columns={"Name":"country", "Code":"code"})

In [43]:
data2 = 'cleaned_data.csv'

In [44]:
data2_df = pd.read_csv(data2)

In [45]:
data2_df.head()

,country,Status,Life Expectancy,Adult Mortality,bmi,ECONOMIC FREEDOM,GDP per Capita,Family,Generosity,Happiness Score
0,Albania,Developing,77.8,74.0,58.0,7.5,1.0,0.5,0.2,4.7
1,Algeria,Developing,75.6,19.0,59.5,5.0,1.1,0.8,0.1,6.4
2,Angola,Developing,52.4,335.0,23.3,5.2,0.8,0.7,0.1,3.9
3,Argentina,Developing,76.3,116.0,62.8,4.8,1.2,1.1,0.1,6.6
4,Armenia,Developing,74.8,118.0,54.9,7.6,0.9,0.6,0.1,4.4

In [46]:
data_merge = pd.merge(code_table, data2_df, on="country")

In [67]:
data_merge.head()

,country,code,Status,Life Expectancy,Adult Mortality,bmi,ECONOMIC FREEDOM,GDP per Capita,Family,Generosity,Happiness Score
0,Albania,AL,Developing,77.8,74.0,58.0,7.5,1.0,0.5,0.2,4.7
1,Algeria,DZ,Developing,75.6,19.0,59.5,5.0,1.1,0.8,0.1,6.4
2,Angola,AO,Developing,52.4,335.0,23.3,5.2,0.8,0.7,0.1,3.9
3,Argentina,AR,Developing,76.3,116.0,62.8,4.8,1.2,1.1,0.1,6.6
4,Armenia,AM,Developing,74.8,118.0,54.9,7.6,0.9,0.6,0.1,4.4

In [66]:
data_merge2= data_merge['code'].str.lower()

In [54]:
data_merge2.head()

0    al
1    dz
2    ao
3    ar
4    am
Name: code, dtype: object

In [57]:
dataframe = pd.DataFrame(data_merge2)

In [61]:
dataframe.head()

  code
0   al
1   dz
2   ao
3   ar
4   am

In [69]:
data_merge['code_lower'] = map(lambda x: x.lower(), data_merge['code'])

In [74]:
data_merge.to_csv("Final_data.csv",index=False)